acoolbest/bootloader_charge_STM32F103ZET6/User/main.c
						default:											break;
					}//end switch
				}
				else
					if(UART3_RXBUFFER[(UART3_RXBUFFE_HEAD+4)&UART3_RX_MAX] ==0xe2)
					{
						//case 0xE2:  
						cmd3_Set_State();//设置HUB号到FLASH
					}
				UART3_RXBUFFE_HEAD += (UART3_RXBUFFER[(UART3_RXBUFFE_HEAD+1)&UART3_RX_MAX]<<1);
				UART3_RXBUFFE_HEAD &= UART3_RX_MAX;//最大字节
			}
		}
		else
		{
			UART3_RX_State = 0;
			UART3_RXBUFFE_HEAD +=1;
			UART3_RXBUFFE_HEAD &= UART3_RX_MAX;//最大字节
		}

	}
} 

void init_base_data(void)
{
	u8 i = 0;
	device.Version[1] = '1'; //硬件功能号 ='1'，ctrl;='2',HUB.
	device.Version[2] = '2'; //硬件版本号
	device.Version[3] = '.';
	
	device.Version[6] = '.';
	
	#ifdef N_VERSION_SOURCECODE//ZHZQ_CHANGE
	device.Version[0] = 'N'; //引导号 BL

	device.Version[4] = '1'; //2017年 写年份的最后两位0-99,4位表一位十进制
	device.Version[5] = '7'; //2017年 
	
	device.Version[7] = '1'; //5月第2版    //Version[1]高四位是月份。低四位是当月产生的版本。
	device.Version[8] = '0'; //5月第2版
	#elif BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	device.Version[0] = 'B'; //引导号 BL

	device.Version[4] = '1'; //2017年 写年份的最后两位0-99,4位表一位十进制
	device.Version[5] = '7'; //2017年 

	device.Version[7] = '1'; //5月第2版    //Version[1]高四位是月份。低四位是当月产生的版本。
	device.Version[8] = '0'; //5月第2版
	#else
	device.Version[0] = 'A'; //引导号 APP

	device.Version[4] = '1'; //2017年 写年份的最后两位0-99,4位表一位十进制
	device.Version[5] = '7'; //2017年 

	device.Version[7] = '1'; //5月第2版    //Version[1]高四位是月份。低四位是当月产生的版本。
	device.Version[8] = '0'; //5月第2版
	#endif
	
	step =0;
	time_s = 0;
	time_sys = 0;
	device.TASK_state =0x00;

	led_power_ctrl(LED_ALL_INDEX, LED_TURN_OFF);

	for(i=0;i<2;i++)
	{
		Delay_ms(150);	
		led_power_ctrl(LED_INDEX, LED_TURN_NEGATION);
	}
}

/**
 * @brief  Enables or disables the High Speed ADC1 and ADC3 peripheral clock.
 * @param  NewState: new state of the specified peripheral clock.
 *   This parameter can be: ENABLE or DISABLE.
 * @retval None
 */
void ADC1_3_PeriphClockCmd(FunctionalState NewState)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, NewState);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC3, NewState);
}

void init_LCD_background(void)
{
	ADC1_3_PeriphClockCmd(DISABLE);
	
	LCDC.LCDPOFFTIME[LCD1_INDEX] = 0XFF;
	LCDC.LCDPOFFTIME[LCD2_INDEX] = 0XFF;
	LCDC.PSwitch = 1;
	LCDC.SPSwitch = 1;
	LCDC.PNum = 0;
	LCDC.LCDPTimeSet = 15;  
	LCDC.LCDPTime[LCD1_INDEX] = 0;
	LCDC.LCDPTime[LCD2_INDEX] = 0;
	LCDC.LCDPID[LCD1_INDEX] =0;
	LCDC.LCDPID[LCD2_INDEX] =0;
	LCDC.LCDSPTimeSet = 60;   //屏保
	LCDC.LCDSPTime[LCD1_INDEX] = 0;
	LCDC.LCDSPTime[LCD2_INDEX] = 0;
	LCDC.LCDSPPID[LCD1_INDEX] =0;
	LCDC.LCDSPPID[LCD2_INDEX] =0;

	#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	display_flash_BMPE (0,0,3,LCDC.LCDSPPID[LCD1_INDEX],3);//单色彩色都支持 调背景
	#endif

	ADC1_3_PeriphClockCmd(ENABLE);
}

void init_LCD_config()
{
	GPIO_ResetBits(LCD_RST_PORT, LCD_RST_PIN);
	Delay_ms(200);	
	GPIO_SetBits(LCD_RST_PORT, LCD_RST_PIN);
	Delay_ms(300);	
	LCD_Init(); 
	LCD_Init1();
	
	#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	Delay_ms(10);
	LCD_Init();
	LCD_Init1();
	#endif
	
	GPIO_ResetBits(LCD_CS1_PORT, LCD_CS1_PIN);
	GPIO_ResetBits(LCD_CS2_PORT, LCD_CS2_PIN);
	
	#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	LCD_Clear(RED);
	Delay_ms(500);	
	LCD_Clear(GREEN);
	Delay_ms(500);
	#else
	Delay_ms(1);
	#endif
	
	LCD_Clear(BLUE);
	//version		
	Version_display(290,device.Version);
	
	#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	Delay_ms(100); 	
	#else
	Delay_ms(2000);
	#endif
	
	//tft_16bitdeep_BMP (220,0,gImage11_240_100_16bitC);		//原LOGO
	GPIO_SetBits(LCD_CS1_PORT, LCD_CS1_PIN);
	GPIO_SetBits(LCD_CS2_PORT, LCD_CS2_PIN);
}

static void init_all_local_data_and_display_on_LCD(void)
{
	u32 i = 0;
	u8 flag = 0;
	FLASH2_GPIOSPI_Read (Addr_04min, str_buffer, 64);  //读取图片张数
	if(str_buffer[0] == 0x67)//项有效
	{
		LCDC.PNum = str_buffer[1];
	}
	FLASH2_GPIOSPI_Read (Addr_info2, &info2STR.head[0], sizeof(info2STR));	//媒休初始化
	if(info2STR.item1[0] == 1 && info2STR.item1[1]==3)//项有效
	{
		LCDC.PSwitch = info2STR.item1_data[0];
		LCDC.LCDPTimeSet = info2STR.item1_data[1];	
		LCDC.LCDPTimeSet <<= 8; 
		LCDC.LCDPTimeSet += info2STR.item1_data[2]; 
	}

	if(info2STR.item2[0] == 2  && info2STR.item2[1]==3)//项有效
	{
		LCDC.SPSwitch = info2STR.item2_data[0];
		LCDC.LCDSPTimeSet = info2STR.item2_data[1];
		LCDC.LCDSPTimeSet <<= 8;	
		LCDC.LCDSPTimeSet += info2STR.item2_data[2];
	}
	if(info2STR.item3[0] == 3 && info2STR.item3[1]==2)//项3有效
	{
	}
	else
	{
		info2STR.item3_data[0] =  0x00;  //关闭提示
		info2STR.item3_data[1] =  0x00;
		//info2STR.item3_data[0] =  0x01;  //开启提示
		//info2STR.item3_data[1] =  0x01;
	}
	flag = 0;
	if(info2STR.item31[0] == 31 && info2STR.item31[1]==9)//项31有效
	{
		flag = 1;
		
		#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
		for(i=0;i<9;i++)
		#else
		for(i=1;i<3;i++)
		#endif
		{
			if(info2STR.item31_data[i] != device.Version[i])
			{
				flag = 0;
				break;
			}
		}			
	}
	#if 1
	if(flag==0)  //项31不正常重启
	{	
		#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
		info2STR.item31[0] = 31;
		info2STR.item31[1] = 9;
		for(i=0;i<9;i++)
		{
			info2STR.item31_data[i] = device.Version[i];
		}
		FLASH2_GPIOSPI_SER(Addr_info2);  ////每次擦擦4K
		FLASH2_GPIOSPI_Write(Addr_info2, &info2STR.head[0], sizeof(info2STR));//写入当前版本号
		//#else
		//NVIC_SystemReset();
		#endif
	}
	#endif
	//获取设备号
	if(info2STR.item81[0] == 81 && info2STR.item81[1]<=16)//项81有效设备号
	{
		for(i=0;i<info2STR.item81[1];i++)
		{
			device_num[i]= info2STR.item81_data[i];
		}
	}
	else			
	{
		info2STR.item81[1] = 8;
		for(i=0;i<info2STR.item81[1];i++)
		{
			device_num[i]= '?';
		}
	}
	device_num[i++]= 0;
	
	#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	tft_DisplayStr(270, 125, device_num, POINT_COLOR, BACK_COLOR, 3);
	#else
	tft_DisplayStr(270, 125, device_num, 0x0000, 0xffff, 3);
	#endif
	
	//初始时间
	for(i=0;i<2;i++)
	{
		Uport_PowerUseTime[i] = 0;
		Uport_PowerShowTime[i] = 0;
	}

	//tft_DisplayStr(52, 0, AnsiChardata,POINT_COLOR, BACK_COLOR,3);

	//display_flash_BMPE (14,118,3,((Uport_PowerUseTime[0]%3600/600)+'0'),3);//时间 分H
	//display_flash_BMPE (14,139,3,((Uport_PowerUseTime[0]%600/60)+'0'),3);//时间 分L
	//display_flash_BMPE (14,174,3,((Uport_PowerUseTime[0]%60/10)+'0'),3);//时间 秒H
	//display_flash_BMPE (14,195,3,((Uport_PowerUseTime[0]%10)+'0'),3);//时间 秒L



	//获取基线,设备号
	//Addr_info,格式：0X67 LEN ADDR F0 XX XX (16字节AD基线) (12字节设备号) CHECK 0X99
	FLASH2_GPIOSPI_Read (Addr_info1, str_buffer, 64);
	global_u8p = (u8*)ADC_Base0;
	for(i=0;i<ADC1_3_ENABLE_CHANNEL_NUM;i++)
	{
		global_u8p[i] = str_buffer[6+i];
		//global_u8p[i] = str_buffer[i];
	}
	//DisplayADC_BL(150, 0, ADC_Base0,POINT_COLOR, BACK_COLOR,1);
	//DisplayADC_BL(150, 0, &ADC_Base0[3],POINT_COLOR, BACK_COLOR,2);
	//DisplayADC_BL(150, 0, &ADC_Base0[5],POINT_COLOR, BACK_COLOR,3);
	
	#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	Get_ADC_BaseLine();
 	DisplayADC_BL(240, (240-8*4)/2, &ADC_Base0[6],POINT_COLOR, BACK_COLOR,3);
	#endif

	//文本区初始	
	//FiletoBuffer_ID(u8 area,u8 id,u8 *p);

	#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	FiletoBuffer_ID(2,48,LCD_TxtBuffer[LCD1_INDEX]);
	FiletoBuffer_ID(2,48,LCD_TxtBuffer[LCD2_INDEX]);
	#else
	LCD_TxtBuffer[LCD1_INDEX][0]=0;
	LCD_TxtBuffer[LCD2_INDEX][0]=0;
	#endif

