acoolbest/bootloader_charge_STM32F103ZET6/User/main.c
	LCD_TxtBuffer[LCD1_INDEX][2048]=0;
	LCD_TxtBuffer[LCD1_INDEX][2049]=0;
	LCD_TxtBuffer[LCD2_INDEX][2048]=0;
	LCD_TxtBuffer[LCD2_INDEX][2049]=0;

	//二维码初始
	FLASH2_GPIOSPI_Read (Addr_01min, str_buffer, 128);
	if(str_buffer[0]==frame_headerC)  //判断有没有二维码
	{
		device.use &= ~0x0C; //有二维码 
	}
	else
	{
		device.use |= 0x0C;//没有二维码
	}
	if((device.use&0x04)==0x0) //有码显示
	{
		#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
		DisplayPROT_EWM(80,56,0,1);  //128
		DisplayPROT_EWM(80,56,1,2);  //128
		#endif
	}
}

static void check_embeded_program_update(void)//更新检查
{
#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	Get_PRO_State();
	Check_CHIP_PRO();	
	Get_PRO_State();
	Delay_ms(100);	
	time_sys = 2000;
#else
	Check_CHIP_PRO();
	Delay_ms(100);
	time_sys = 0;
#endif
}

void check_key_press_down_to_reset_board(void)
{
	u32 i = 0;
	if(GPIO_ReadInputDataBit(KEY_PORT,KEY_PIN) ==0)  //按键=0,1S进行人为复位
	{
		#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
		KEY_time = time_sys;
		while(GPIO_ReadInputDataBit(KEY_PORT,KEY_PIN) ==0)
		{
			led_power_ctrl(LED_INDEX, LED_TURN_ON);
			if(time_sys-KEY_time>=10000)
			{
				FLASH2_GPIOSPI_Read (Addr_info2, &info2STR.head[0], sizeof(info2STR));	//媒休初始化
				info2STR.item21[0] = 21;
				info2STR.item21[1] = 4;
				info2STR.item21_data[0] = 0xE0;  //自毁
				info2STR.item21_data[1] = 0x00;
				info2STR.item21_data[2] = 0;  
				info2STR.item21_data[3] = 0;
				FLASH2_GPIOSPI_SER(Addr_info2);  //每次擦擦4K
				FLASH2_GPIOSPI_Write(Addr_info2, &info2STR.head[0], sizeof(info2STR));
				break;
			}
		}
		#endif
		rewrite_ADC_BaseLine_flash_data();
		i=1000;
		while(i--);
		NVIC_SystemReset();
	}
}

#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
static void bootloader_check_app_program_at_regular_time(void)
{
	Get_PRO_State();
	if(KEEP_EN==0xff) return;

	if((device.Version[0]==Version_FLAG1) &&(APP_EN==1))
	{			
		UART_BUFFER[0] = 'R';
		UART_BUFFER[1] = 'u';
		UART_BUFFER[2] = 'n';
		UART_BUFFER[3] = ' ';
		UART_BUFFER[4] = 'A';
		UART_BUFFER[5] = 'P';
		UART_BUFFER[6] = 'P';
		UART_BUFFER[7] = 0;
		tft_DisplayStr(100, (240-8*7)/2, UART_BUFFER,POINT_COLOR, BACK_COLOR,3);
		Delay_ms(1000);	
		Goto_APP(FLASH_APP1_ADDR);
	}
	else
	{
		Check_CHIP_PRO();
		Get_PRO_State();
	}
}
#endif

void update_qrcode_at_regular_time(void)
{
	#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	u8 lcd_index = 0;
	u8 lcd_cs = 0;
	u8 file_num = 0;
	#endif
	
	if(time_sys-check_time >= 5000)			//定时检测设备
	{
		#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
		bootloader_check_app_program_at_regular_time();
		#endif
		check_time = time_sys;
		led_power_ctrl(LED_INDEX, LED_TURN_ON);

		if((device.use&0x10)==0x10) //二维码有更新
		{
			device.use &= ~0x10;
			#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
			for(lcd_index=0;lcd_index<2;lcd_index++)
			{
				lcd_cs = lcd_index+1;
				file_num = lcd_index;
				if(LCDC.LCDSPPID[lcd_index]==1)
				{
					DisplayPROT_EWM(115,56,file_num,lcd_cs);  //128
					//tft_DisplayStr(15, 125, device_num,0x0000,0xffff,lcd_cs);
				}
				else if(LCDC.LCDSPPID[lcd_index]==0)
				{
					DisplayPROT_EWM(80,56,file_num,lcd_cs);  //128
					//tft_DisplayStr(270, 125, device_num,0x0000,0xffff,lcd_cs);
				}

			}
			#endif
		}
	}
}

/**
 * @brief  update LCD1 or LCD2 screen protect.
 * @param  lcd_index: specifies the LCD index.
 *   This parameter can be: LCD1_INDEX or LCD2_INDEX.
 * @retval None
 */
static void update_screen_protect(u8 lcd_index)
{
	#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
	u8 lcd_cs = lcd_index+1;
	u8 file_num = lcd_index;
	#endif
	
	if((LCDC.LCDSPTime[lcd_index]>=LCDC.LCDSPTimeSet)&&(time_sys-time_s_temp<300))//LCD更新屏保
	{
		LCDC.LCDSPTime[lcd_index] -=LCDC.LCDSPTimeSet;
		
		#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
		if(LCDC.LCDSPPID[lcd_index]!=2)
		{
			if(LCDC.LCDSPPID[lcd_index]<1)
			{
				LCDC.LCDSPPID[lcd_index]++;
			}
			else
			{
				LCDC.LCDSPPID[lcd_index] = 0;
			}
			display_flash_BMPE (0,0,3,LCDC.LCDSPPID[lcd_index],lcd_cs);//单色彩色都支持 调背景
			if(LCDC.LCDSPPID[lcd_index]==1)
			{
				DisplayPROT_EWM(115,56,file_num,lcd_cs);  //128
				tft_DisplayStr(15, 125, device_num,0x0000,0xffff,lcd_cs);
			}
			else
			{
				DisplayPROT_EWM(80,56,file_num,lcd_cs);  //128
				tft_DisplayStr(270, 125, device_num,0x0000,0xffff,lcd_cs);
			}
		}
		#endif
	}
}

void update_LCD1_screen_protect(void)
{
	update_screen_protect(LCD1_INDEX);
}

void update_LCD2_screen_protect(void)
{
	update_screen_protect(LCD2_INDEX);
}

void update_advertisement()
{
	u8 i = 0;
	u8 lcd_index = 0;
	u8 lcd_cs = 0;
	for(i=0;i<2;i++)
	{
		lcd_index = i;
		lcd_cs = lcd_index+1;
		if((LCDC.LCDPTime[lcd_index]>=LCDC.LCDPTimeSet)&&(time_sys-time_s_temp<300))//LCD更新广告
		{
			LCDC.LCDPTime[lcd_index] -=LCDC.LCDPTimeSet;

			if(LCDC.PSwitch==1)
			{
				LCDC.LCDPID[lcd_index]++;
				if(LCDC.LCDPID[lcd_index]>=LCDC.PNum)
				{
					LCDC.LCDPID[lcd_index]=0;
				}
				#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
				AD_count[LCDC.LCDPID[lcd_index]]++;   //广告计数
				#endif
				display_flash_BMPE (116,0,4,LCDC.LCDPID[lcd_index],lcd_cs);//广告
			}
		}
	}

}

void LCD_into_power_on_state()
{
	u8 i = 0;
	u8 lcd_index = 0;
	u8 lcd_cs = 0;
	u8 Uport_PowerUseTime_index = 0;

	for(i=0;i<2;i++)
	{
		lcd_index = i;
		lcd_cs = lcd_index+1;
		Uport_PowerUseTime_index = lcd_index;
		if((Uport_PowerUseTime[Uport_PowerUseTime_index]>0)&&(LCDC.LCDSPPID[lcd_index]!=2))//LCD进入充电
		{
			LCDC.LCDSPPID[lcd_index] = 2;
			display_flash_BMPE (0,0,3,LCDC.LCDSPPID[lcd_index],lcd_cs);//单色彩色都支持 调背景
		}
	}
}

void synthesize_function(u8 lcd_index)
{
	u8 lcd_cs = lcd_index+1;
	u8 Uport_PowerUseTime_index = lcd_index;
	u8 file_num = lcd_index;
	u8 led_index = lcd_index+1;
	u32 i = 0;
#if 1
	AnsiChardata[12] = Uport_PowerUseTime[Uport_PowerUseTime_index]/36000+'0';
	AnsiChardata[13] = Uport_PowerUseTime[Uport_PowerUseTime_index]%36000/3600+'0';
	AnsiChardata[19] = Uport_PowerUseTime[Uport_PowerUseTime_index]%3600/600+'0';
	AnsiChardata[20] = Uport_PowerUseTime[Uport_PowerUseTime_index]%600/60+'0';
	AnsiChardata[24] = Uport_PowerUseTime[Uport_PowerUseTime_index]%60/10+'0';
	AnsiChardata[25] = Uport_PowerUseTime[Uport_PowerUseTime_index]%10+'0';
#endif

	if(LCDC.LCDSPPID[lcd_index]==2)
	{
		display_flash_BMPE (18,120,3,((Uport_PowerShowTime[Uport_PowerUseTime_index]%3600/600)+'0'),lcd_cs);//时间 分H
		display_flash_BMPE (18,141,3,((Uport_PowerShowTime[Uport_PowerUseTime_index]%600/60)+'0'),lcd_cs);//时间 分L
		display_flash_BMPE (18,176,3,((Uport_PowerShowTime[Uport_PowerUseTime_index]%60/10)+'0'),lcd_cs);//时间 秒H
		display_flash_BMPE (18,197,3,((Uport_PowerShowTime[Uport_PowerUseTime_index]%10)+'0'),lcd_cs);//时间 秒L
	}

	if(Uport_PowerUseTime[Uport_PowerUseTime_index]>0)
	{
		Uport_PowerUseTime[Uport_PowerUseTime_index]--;
		//led_power_ctrl(led_index, LED_TURN_OFF);
		LCDC.LCDPOFFTIME[lcd_index]=0; //断电计时
	}
	else
	{
		//led_power_ctrl(led_index, LED_TURN_ON);
		for(i=lcd_index*3;i<(lcd_index+1)*3;i++)
		{
			usb_power_ctrl(i, USB_POWER_OFF);
			Dport_State[i] = 0;
		}
		LCDC.LCDPTime[lcd_index]=0;		//广告计时
	}

	if(Uport_PowerShowTime[Uport_PowerUseTime_index]>0)
	{
		Uport_PowerShowTime[Uport_PowerUseTime_index]--;
		led_power_ctrl(led_index, LED_TURN_ON);
	}
	else
	{
		led_power_ctrl(led_index, LED_TURN_OFF);
	}

	if(LCDC.LCDPOFFTIME[lcd_index]==1)  //断电1秒调文字
	{
		FiletoBuffer_ID(2,48,LCD_TxtBuffer[lcd_index]);
		LCD_TxtBuffer[lcd_index][2048]=0;
		LCD_TxtBuffer[lcd_index][2049]=0;
	}
	else if(LCDC.LCDPOFFTIME[lcd_index]==5)  //断电后5秒调文字
	{
		LCDC.LCDSPTime[lcd_index] = 0;  //屏保时间
		LCDC.LCDSPPID[lcd_index] = 0;
		display_flash_BMPE (0,0,3,LCDC.LCDSPPID[lcd_index],lcd_cs);//单色彩色都支持 调背景
		DisplayPROT_EWM(80,56,file_num,lcd_cs);  //128
		tft_DisplayStr(270, 125, device_num,0x0000,0xffff,lcd_cs);
		
