acoolbest/bootloader_charge_STM32F103ZET6/User/main.c
		#ifndef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
		for(i=0;i<sizeof(gImage10_16_288_1bitC);i++)
		{
			LCD_TxtBuffer[lcd_index][i] = gImage10_16_288_1bitC[i];
		}
		LCD_TxtBuffer[lcd_index][2048]=0;
		LCD_TxtBuffer[lcd_index][2049]=0;
		#endif
	}
}

void check_hub_link_state(void)
{
	static u32 time_sys_temp;
	if(time_sys-time_sys_temp >= 2000)			//时间控制任务
	{
		time_sys_temp = time_sys;
		LCD_TEST();
		if((time_s-testcmd3_time)>=5)  //0x16 0xe2都有确认连接功能
		{
			UART_BUFFER[0] = 'U';
			//UART_BUFFER[1] = 'n';
			//UART_BUFFER[2] = 'l';
			//UART_BUFFER[3] = 'i';
			//UART_BUFFER[4] = 0;
			UART_BUFFER[1] = (device.addr>>4)+'0';
			UART_BUFFER[2] = (device.addr&0x0f)+'0';
			UART_BUFFER[3] = 0;
			if((time_s-testcmd1_time)>=30)  //30秒没收到正确命令认为断开连接
			{
				UART_BUFFER[0] = 'u';
			}
			if(info2STR.item3_data[1]==0x01)
			{
				tft_DisplayStr(0, 0, UART_BUFFER,POINT_COLOR, BACK_COLOR,3);
			}
			GPIO_ResetBits(RJ45_IO1_PORT, RJ45_IO1_PIN);
		}
		else
		{
			UART_BUFFER[0] = 'L';
			//UART_BUFFER[1] = 'i';
			//UART_BUFFER[2] = 'n';
			//UART_BUFFER[3] = 'k';
			//UART_BUFFER[4] = 0;
			UART_BUFFER[1] = (device.addr>>4)+'0';
			UART_BUFFER[2] = (device.addr&0x0f)+'0';
			UART_BUFFER[3] = 0;
			if((time_s-testcmd1_time)>=30)  //30秒没收到正确命令认为断开连接
			{
				UART_BUFFER[0] = 'l';
			}
			if(info2STR.item3_data[1]==0x01)
			{
				tft_DisplayStr(0, 0, UART_BUFFER,POINT_COLOR, BACK_COLOR,3);
			}
		}
	}
}

void check_device_plugin()
{
	u8 lcd_index = 0;

	for(lcd_index=0;lcd_index<2;lcd_index++)
	{
		if(Uport_PowerUseTime[lcd_index]>0)
		{
			port_Charge_State(lcd_index);
		}
		else
		{
			checking_port[lcd_index] = 0x00;  //SUB置空
		}
	}
}


void deal_LCD_task_at_regular_time(u8 lcd_index)
{
	u8 lcd_cs = lcd_index+1;
	static u32 time_sys_temp[2];

	if((time_sys-time_sys_temp[lcd_index] >= 1000))			//时间控制任务
	{
		time_sys_temp[lcd_index] = time_sys;
		if(LCDC.LCDSPPID[lcd_index]==2)
		{
			tft_1bitdeep_TXT (87, 0, LCD_TxtBuffer[lcd_index],POINT_COLOR, 0xffff,lcd_cs);
		}
	}
}

void deal_LCD1_task_at_regular_time(void)
{
	deal_LCD_task_at_regular_time(LCD1_INDEX);
}

void deal_LCD2_task_at_regular_time(void)
{
	deal_LCD_task_at_regular_time(LCD2_INDEX);
}

void deal_task_at_regular_time0(u8 lcd_index)//ZHZQ_CHANGE
{
	u8 i = 0;
	u8 lcd_cs = lcd_index+1;
	u8 lcd_index_ascii = lcd_index+'1';
	if(LCDC.LCDPOFFTIME[lcd_index]<0xff)	//断电计时
	{
		LCDC.LCDPOFFTIME[lcd_index]++;
	}
	LCDC.LCDPTime[lcd_index]++;		//广告计时
	LCDC.LCDSPTime[lcd_index]++;  //屏保时间

	if((checking_port[lcd_index]&0xF0)==0x20)
	{
		usb_mutually_exclusive_power_on(lcd_index);	//互斥上电
	}

	UART_BUFFER[0] = lcd_index_ascii;
	for(i=0;i<3;i++)
	{
		UART_BUFFER[1+i] = Dport_State[3*lcd_index+i]+'0';
	}
	UART_BUFFER[1+i] =0;
	if(info2STR.item3_data[0]==0x01)
	{
		tft_DisplayStr(0, 32, UART_BUFFER, POINT_COLOR, BACK_COLOR, lcd_cs);
	}
}

void deal_task_at_regular_time()
{
	if(time_sys-time_s_temp >= 1000)			//时间控制任务
	{
		time_s_temp +=1000;
		time_s++;
		#ifdef BOOTLOADER_SOURCECODE//ZHZQ_CHANGE
		if(device.Version[0]==Version_FLAG1)   
		{
			UART_BUFFER[0] = time_s/36000+'0';
			UART_BUFFER[1] = time_s%36000/3600+'0';
			UART_BUFFER[2] = time_s%3600/600+'0';
			UART_BUFFER[3] = time_s%600/60+'0';
			UART_BUFFER[4] = time_s%60/10+'0';
			UART_BUFFER[5] = time_s%10+'0';
			UART_BUFFER[6] = 'S';
			UART_BUFFER[7] = 0;
			tft_DisplayStr(270, 0, UART_BUFFER, POINT_COLOR, BACK_COLOR, 3);
		}
		#endif
		deal_task_at_regular_time0(LCD1_INDEX);
		deal_task_at_regular_time0(LCD2_INDEX);
		synthesize_function(LCD1_INDEX);
		synthesize_function(LCD2_INDEX);
	}
}

static VOID_FUNC_START_ROUTINE void_func[VOID_FUNC_COUNT] = {
	check_key_press_down_to_reset_board,
	update_qrcode_at_regular_time,
	deal_task_at_regular_time,
	deal_LCD1_task_at_regular_time,
	deal_LCD2_task_at_regular_time,
	check_hub_link_state,
	check_device_plugin,
	update_LCD1_screen_protect,
	update_LCD2_screen_protect,
	update_advertisement,
	LCD_into_power_on_state
};


/**
 * @brief  主函数
 * @param  无  
 * @retval 无
 */
int main(void)
{
	u32 i;

	/* 系统定时器 1us 定时初始化 */
	SysTick_Init();
	//CPU_CRITICAL_ENTER();
	LED_GPIO_Config();
	ADC_Configuration();
	//DAC_Configuration();
	UART_Configuration();
	SPI_Configuration();
	DMA_Configuration();
	LCD_IOConfig();
	FSMC_LCDInit();
	NVIC_Configuration();
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE);//开中断
	ADC_ITConfig(ADC3, ADC_IT_EOC, ENABLE);//开中断
	//DMA_ITConfig(DMA1_Channel1,DMA_IT_TC,ENABLE);  //配置DMA发送完成后产生中断
	//SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_RXNE, ENABLE);
	IWDG_Init(6,0xfff);   //OPEN DOG =26S
	//CPU_CRITICAL_EXIT();

	init_base_data();

	//Addr_Set();
	//hub_id_info();

	usb_power_ctrl(USB_ALL_INDEX, USB_POWER_OFF);//初始化USB上电状态，关闭上电

	//初始LCD
	init_LCD_config();
	init_LCD_background();
	init_all_local_data_and_display_on_LCD();
	
	//更新检查
	check_embeded_program_update();
	
	while(1)
	{
		for(i=0;i<VOID_FUNC_COUNT;i++) 
		{
			void_func[i]();
			uart1_cmd();
			uart3_cmd();
		}
	}
}

/* ------------------------------------------end of file---------------------------------------- */

